/*
--- loop ---
while (เงื่อนไข){

}

+++++++++++++++++++++++++++++++++++++++++
do{
    คำสั่ง...

}while(เงื่อนไข);

++++++++++++++++++++++++++++++++++++++++
for(ตัวเเปรพร้อม ค่าเรื่มต้น ; เงื่อนไข ; การเพิ่ม-ลด ค่าตัวเเปร){
    คำสั่ง
}







*/ 

#include <stdio.h>


int main(){

int i;
for(i=1; i<=5; i++){
    printf("%d - hello.. - ", i); // 
    
}
printf("\n-------------------------------\n");

i = 1;
while (i <= 5 ){
       printf("%d - hello.. - ", i); 
       i++;
}
printf("\n-------------------------------\n");

i = 1;

do{
    printf("%d - hello.. - ", i); 
    i++;
    }while( i <= 5 );

printf("\n-------------------------------\n");

return 0;

}